---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
AnalysisDisplayMarkersAndTextSettings Constructor
AnalysisDisplayMarkersAndTextSettings Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | AnalysisDisplayMarkersAndTextSettings()()()() | Constructs a default instance of markers and text settings. |
|  | AnalysisDisplayMarkersAndTextSettings(AnalysisDisplayMarkersAndTextSettings) | Constructs a new copy of the input AnalysisDisplayMarkersAndTextSettings object. |

# See Also

AnalysisDisplayMarkersAndTextSettings Class

AnalysisDisplayMarkersAndTextSettings Members

Autodesk.Revit.DB.Analysis Namespace